In [3]:
import pandas as pd
import sqlite3

In [2]:
df_movie_gross = pd.read_csv("../../data/bom.movie_gross.csv.gz")

In [3]:
df_movies = pd.read_csv("../../data/tmdb.movies.csv.gz")

In [4]:
df_budget = pd.read_csv("../../data/tn.movie_budgets.csv.gz")

In [5]:
df_info = pd.read_csv("../../data/rt.movie_info.tsv.gz", sep='\t')

In [4]:
conn = sqlite3.connect('../../data/im.db')

In [5]:
df = pd.read_sql("""SELECT * FROM movie_ratings;""", conn)
df

         movie_id  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [8]:
df = pd.read_sql("""SELECT * FROM directors;""", conn)
df

         movie_id   person_id
0       tt0285252   nm0899854
1       tt0462036   nm1940585
2       tt0835418   nm0151540
3       tt0835418   nm0151540
4       tt0878654   nm0089502
...           ...         ...
291169  tt8999974  nm10122357
291170  tt9001390   nm6711477
291171  tt9001494  nm10123242
291172  tt9001494  nm10123248
291173  tt9004986   nm4993825

[291174 rows x 2 columns]

In [7]:
q = """
SELECT *
FROM movie_ratings
JOIN directors
    USING(movie_id)
;
"""
pd.read_sql(q, conn)

          movie_id  averagerating  numvotes   person_id
0       tt10356526            8.3        31   nm8353804
1       tt10356526            8.3        31   nm8353804
2       tt10384606            8.9       559   nm9250842
3       tt10384606            8.9       559   nm9932562
4        tt1042974            6.4        20   nm1915232
...            ...            ...       ...         ...
181384   tt9844256            7.5        24   nm0849465
181385   tt9844256            7.5        24   nm0849465
181386   tt9851050            4.7        14   nm1272773
181387   tt9886934            7.0         5   nm0001206
181388   tt9894098            6.3       128  nm10529107

[181389 rows x 4 columns]

In [6]:
q = """
SELECT *
FROM persons
JOIN directors 
    USING(person_id)
;
"""
pd.read_sql(q, conn)

,person_id,primary_name,birth_year,death_year,primary_profession,movie_id
0,nm0062879,Ruel S. Bayani,NaN,NaN,"director,production_manager,miscellaneous",tt1592569
1,nm0062879,Ruel S. Bayani,NaN,NaN,"director,production_manager,miscellaneous",tt1592569
2,nm0062879,Ruel S. Bayani,NaN,NaN,"director,production_manager,miscellaneous",tt1592569
3,nm0062879,Ruel S. Bayani,NaN,NaN,"director,production_manager,miscellaneous",tt1592569
4,nm0062879,Ruel S. Bayani,NaN,NaN,"director,production_manager,miscellaneous",tt2057445
...,...,...,...,...,...,...
291166,nm9980896,Rama Narayanan,NaN,NaN,"director,writer",tt8715016
291167,nm9980896,Rama Narayanan,NaN,NaN,"director,writer",tt8919136
291168,nm9981679,Samir Eshra,NaN,NaN,"director,writer,cinematographer",tt8717234
291169,nm9993380,Pegasus Envoyé,NaN,NaN,"director,actor,writer",tt8743182
291170,nm9993380,Pegasus Envoyé,NaN,NaN,"director,actor,writer",tt8743182